<?php

return [
    'trainers'  => [
        'create'    => [
            'form'  => [
                'about'             => 'وصف',
                'confirm_password'  => 'تاكيد كلمة المرور',
                'country'           => 'البلد',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'info'              => 'البيانات',
                'job_title'         => 'التخصص',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'كلمة المرور',
                'profile'           => 'الملف الشخصي',
                'roles'             => 'الادوار',
                'add_sliders' => 'إضافة سلايد',
                'sliders'  => 'سلايدر',
                'description'  => 'الوصف',
            ],
            'title' => 'اضافة مدربين',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'مدربين',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
                'roles'             => 'الادوار',
                'add_sliders' => 'إضافة سلايد',
                'sliders'  => 'سلايدر',
                'description'  => 'الوصف',
            ],
            'title' => 'تعديل مدربين',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
            'roles'     => [
                'required'  => 'من فضلك اختر ادوار المدير',
            ],
        ],
    ],
      'applies'  => [
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            'cv'            => 'cv',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'مدربين',
        ],
        'show'     => [
            'applier_data' => 'بيانات المقدم',
        ],
        'routes'=>[
            'index'=>'التقديم ك متدرب',
        ]

    ],
];
